backend/app/controllers/beers_controller.rb

SELECT "beers".* FROM "beers"
SELECT "reviews".* FROM "reviews" WHERE "reviews"."beer_id" = $1  [["beer_id", 1]]
SELECT  "beers".* FROM "beers" WHERE "beers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT  "styles".* FROM "styles" WHERE "styles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def index
    beers_db = Beer.all
    reviews = Review.all
    beers = []
    beers_db.map do |beer|
      beer = beer.as_json
      beer[:reviews] = Beer.find(beer["id"]).reviews.as_json.map do |review|
        review[:username] = Review.find(review["id"]).user.username
        review
      end
      beer[:style] = Beer.find(beer["id"]).style.as_json
      beer[:country] = Beer.find(beer["id"]).country.as_json

INSERT INTO "beers" ("name", "brewery", "country_id", "notes", "abv", "image", "created_at", "updated_at", "style_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    beer = Beer.create(beer_params)