backend/app/controllers/styles_controller.rb

  def index
    styles = Style.all
---
SELECT "styles".* FROM "styles"