app/controllers/countries_controller.rb

    def index
        countries = Countries.all
---
SELECT "countries".* FROM "countries"